{
  "displayName": "EQU BL - CA 001 - Require Compliant Device",
  "state": "enabled",
  "conditions": {
    "applications": {
      "includeApplications": ["All"],
      "excludeApplications": []
    },
    "clientAppTypes": ["all"],
    "platforms": {
      "includePlatforms": ["windows", "macOS"],
      "excludePlatforms": []
    },
    "users": {
      "includeUsers": ["All"],
      "includeGroups": [],
      "includeRoles": [],
      "excludeUsers": ["de834e79-c901-4e95-9d99-581cb5f37ec1"],
      "excludeGroups": [],
      "excludeRoles": ["d29b2b05-8046-44ba-8758-1e26182fcf32"],
      "excludeGuestsOrExternalUsers": {
        "externalTenants": { "membershipKind": "all" },
        "guestOrExternalUserTypes": "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider"
      }
    },
    "servicePrincipalRiskLevels": [],
    "signInRiskLevels": [],
    "userRiskLevels": []
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": ["compliantDevice"],
    "termsOfUse": [],
    "customAuthenticationFactors": []
  },
  "sessionControls": {}
}
